/*==============================================================*/
/* DBMS name:      Sybase SQL Anywhere 12                       */
/* Created on:     2018/12/5 19:59:23                           */
/*==============================================================*/


if exists(select 1 from sys.sysforeignkey where role='FK_专辑311600_专辑3116005_歌曲信息3116') then
    alter table 专辑3116005161张秉坤
       delete foreign key FK_专辑311600_专辑3116005_歌曲信息3116
end if;

if exists(select 1 from sys.sysforeignkey where role='FK_专辑311600_专辑3116005_歌手信息3116') then
    alter table 专辑3116005161张秉坤
       delete foreign key FK_专辑311600_专辑3116005_歌手信息3116
end if;

if exists(select 1 from sys.sysforeignkey where role='FK_喜欢311600_喜欢3116005_用户信息3116') then
    alter table 喜欢3116005161张秉坤
       delete foreign key FK_喜欢311600_喜欢3116005_用户信息3116
end if;

if exists(select 1 from sys.sysforeignkey where role='FK_喜欢311600_喜欢3116005_歌手信息3116') then
    alter table 喜欢3116005161张秉坤
       delete foreign key FK_喜欢311600_喜欢3116005_歌手信息3116
end if;

if exists(select 1 from sys.sysforeignkey where role='FK_点歌311600_点歌3116005_用户信息3116') then
    alter table 点歌3116005161张秉坤
       delete foreign key FK_点歌311600_点歌3116005_用户信息3116
end if;

if exists(select 1 from sys.sysforeignkey where role='FK_点歌311600_点歌3116005_歌曲信息3116') then
    alter table 点歌3116005161张秉坤
       delete foreign key FK_点歌311600_点歌3116005_歌曲信息3116
end if;

drop index if exists 专辑3116005161张秉坤.专辑3116005161张秉坤_FK;

drop index if exists 专辑3116005161张秉坤.专辑3116005161张秉坤2_FK;

drop index if exists 专辑3116005161张秉坤.专辑3116005161张秉坤_PK;

drop table if exists 专辑3116005161张秉坤;

drop index if exists 喜欢3116005161张秉坤.喜欢3116005161张秉坤_FK;

drop index if exists 喜欢3116005161张秉坤.喜欢3116005161张秉坤2_FK;

drop index if exists 喜欢3116005161张秉坤.喜欢3116005161张秉坤_PK;

drop table if exists 喜欢3116005161张秉坤;

drop index if exists 歌手信息3116005161张秉坤.歌手信息3116005161张秉坤_PK;

drop table if exists 歌手信息3116005161张秉坤;

drop index if exists 歌曲信息3116005161张秉坤.歌曲信息3116005161张秉坤_PK;

drop table if exists 歌曲信息3116005161张秉坤;

drop index if exists 点歌3116005161张秉坤.点歌3116005161张秉坤2_FK;

drop index if exists 点歌3116005161张秉坤.点歌3116005161张秉坤_FK;

drop index if exists 点歌3116005161张秉坤.点歌3116005161张秉坤_PK;

drop table if exists 点歌3116005161张秉坤;

drop index if exists 用户信息3116005161张秉坤.用户信息3116005161张秉坤_PK;

drop table if exists 用户信息3116005161张秉坤;

/*==============================================================*/
/* Table: 专辑3116005161张秉坤                                       */
/*==============================================================*/
create table 专辑3116005161张秉坤 
(
   歌曲编号                 char(10)                       not null,
   歌手编号                 char(10)                       not null,
   发布时间                 date                           null,
   constraint PK_专辑3116005161张秉坤 primary key (歌曲编号, 歌手编号)
);

/*==============================================================*/
/* Index: 专辑3116005161张秉坤_PK                                    */
/*==============================================================*/
create unique index 专辑3116005161张秉坤_PK on 专辑3116005161张秉坤 (
歌曲编号 ASC,
歌手编号 ASC
);

/*==============================================================*/
/* Index: 专辑3116005161张秉坤2_FK                                   */
/*==============================================================*/
create index 专辑3116005161张秉坤2_FK on 专辑3116005161张秉坤 (
歌手编号 ASC
);

/*==============================================================*/
/* Index: 专辑3116005161张秉坤_FK                                    */
/*==============================================================*/
create index 专辑3116005161张秉坤_FK on 专辑3116005161张秉坤 (
歌曲编号 ASC
);

/*==============================================================*/
/* Table: 喜欢3116005161张秉坤                                       */
/*==============================================================*/
create table 喜欢3116005161张秉坤 
(
   用户编号                 char(10)                       not null,
   歌手编号                 char(10)                       not null,
   点歌次数                 integer                        null,
   constraint PK_喜欢3116005161张秉坤 primary key (用户编号, 歌手编号)
);

/*==============================================================*/
/* Index: 喜欢3116005161张秉坤_PK                                    */
/*==============================================================*/
create unique index 喜欢3116005161张秉坤_PK on 喜欢3116005161张秉坤 (
用户编号 ASC,
歌手编号 ASC
);

/*==============================================================*/
/* Index: 喜欢3116005161张秉坤2_FK                                   */
/*==============================================================*/
create index 喜欢3116005161张秉坤2_FK on 喜欢3116005161张秉坤 (
歌手编号 ASC
);

/*==============================================================*/
/* Index: 喜欢3116005161张秉坤_FK                                    */
/*==============================================================*/
create index 喜欢3116005161张秉坤_FK on 喜欢3116005161张秉坤 (
用户编号 ASC
);

/*==============================================================*/
/* Table: 歌手信息3116005161张秉坤                                     */
/*==============================================================*/
create table 歌手信息3116005161张秉坤 
(
   歌手编号                 char(10)                       not null,
   姓名                   char(20)                       null,
   性别                   char(10)                       null,
   国籍                   char(10)                       null,
   拼音缩写                 char(10)                       null,
   类型                   char(10)                       null,
   录入时间                 date                           null,
   备注                   char(256)                      null,
   constraint PK_歌手信息3116005161张秉坤 primary key (歌手编号)
);

/*==============================================================*/
/* Index: 歌手信息3116005161张秉坤_PK                                  */
/*==============================================================*/
create unique index 歌手信息3116005161张秉坤_PK on 歌手信息3116005161张秉坤 (
歌手编号 ASC
);

/*==============================================================*/
/* Table: 歌曲信息3116005161张秉坤                                     */
/*==============================================================*/
create table 歌曲信息3116005161张秉坤 
(
   歌曲编号                 char(10)                       not null,
   歌名                   char(10)                       null,
   语言                   char(10)                       null,
   拼音缩写                 char(10)                       null,
   类型                   char(10)                       null,
   录入时间                 date                           null,
   备注                   char(256)                      null,
   constraint PK_歌曲信息3116005161张秉坤 primary key (歌曲编号)
);

/*==============================================================*/
/* Index: 歌曲信息3116005161张秉坤_PK                                  */
/*==============================================================*/
create unique index 歌曲信息3116005161张秉坤_PK on 歌曲信息3116005161张秉坤 (
歌曲编号 ASC
);

/*==============================================================*/
/* Table: 点歌3116005161张秉坤                                       */
/*==============================================================*/
create table 点歌3116005161张秉坤 
(
   用户编号                 char(10)                       not null,
   歌曲编号                 char(10)                       not null,
   播放序号                 smallint                       null,
   constraint PK_点歌3116005161张秉坤 primary key (用户编号, 歌曲编号)
);

/*==============================================================*/
/* Index: 点歌3116005161张秉坤_PK                                    */
/*==============================================================*/
create unique index 点歌3116005161张秉坤_PK on 点歌3116005161张秉坤 (
用户编号 ASC,
歌曲编号 ASC
);

/*==============================================================*/
/* Index: 点歌3116005161张秉坤_FK                                    */
/*==============================================================*/
create index 点歌3116005161张秉坤_FK on 点歌3116005161张秉坤 (
用户编号 ASC
);

/*==============================================================*/
/* Index: 点歌3116005161张秉坤2_FK                                   */
/*==============================================================*/
create index 点歌3116005161张秉坤2_FK on 点歌3116005161张秉坤 (
歌曲编号 ASC
);

/*==============================================================*/
/* Table: 用户信息3116005161张秉坤                                     */
/*==============================================================*/
create table 用户信息3116005161张秉坤 
(
   用户编号                 char(10)                       not null,
   姓名                   char(20)                       null,
   性别                   char(10)                       null,
   出生日期                 date                           null,
   注册时间                 date                           null,
   constraint PK_用户信息3116005161张秉坤 primary key (用户编号)
);

/*==============================================================*/
/* Index: 用户信息3116005161张秉坤_PK                                  */
/*==============================================================*/
create unique index 用户信息3116005161张秉坤_PK on 用户信息3116005161张秉坤 (
用户编号 ASC
);

alter table 专辑3116005161张秉坤
   add constraint FK_专辑311600_专辑3116005_歌曲信息3116 foreign key (歌曲编号)
      references 歌曲信息3116005161张秉坤 (歌曲编号)
      on update restrict
      on delete restrict;

alter table 专辑3116005161张秉坤
   add constraint FK_专辑311600_专辑3116005_歌手信息3116 foreign key (歌手编号)
      references 歌手信息3116005161张秉坤 (歌手编号)
      on update restrict
      on delete restrict;

alter table 喜欢3116005161张秉坤
   add constraint FK_喜欢311600_喜欢3116005_用户信息3116 foreign key (用户编号)
      references 用户信息3116005161张秉坤 (用户编号)
      on update restrict
      on delete restrict;

alter table 喜欢3116005161张秉坤
   add constraint FK_喜欢311600_喜欢3116005_歌手信息3116 foreign key (歌手编号)
      references 歌手信息3116005161张秉坤 (歌手编号)
      on update restrict
      on delete restrict;

alter table 点歌3116005161张秉坤
   add constraint FK_点歌311600_点歌3116005_用户信息3116 foreign key (用户编号)
      references 用户信息3116005161张秉坤 (用户编号)
      on update restrict
      on delete restrict;

alter table 点歌3116005161张秉坤
   add constraint FK_点歌311600_点歌3116005_歌曲信息3116 foreign key (歌曲编号)
      references 歌曲信息3116005161张秉坤 (歌曲编号)
      on update restrict
      on delete restrict;

